Reading CSV file in Pandas

In [1]:
import pandas as pd

In [ ]:
df_csv = pd.read_csv('sales_data_sample.csv',encoding="latin1")
df_csv

In [ ]:
df_json = pd.read_json('sample_Data.json')
df_json

In [ ]:
df_excel = pd.read_excel('SampleSuperstore.xlsx')
df_excel

In [12]:
data = {
    "Name":["Rajendra Chimala","Binod Bohara","Khum Chy"],
    "Age":[10,20,30],
    "City":["Doti","Achham","Kailali"]
}


df = pd.DataFrame(data)
df

# Saving data in CSV file
df.to_csv("Dataframe_Saved_In_CSV_File.csv",index=False)
df.to_excel("Dataframe_Saved_In_Excel_File.xlsx",index=False)
df.to_json("Dataframe_Saved_In_JSON_File.json",index=False)

In [15]:
df_csv = pd.read_csv('sales_data_sample.csv',encoding="latin1")

df_csv.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium

In [16]:
df_csv = pd.read_csv('sales_data_sample.csv',encoding="latin1")

df_csv.tail()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
2818,10350,20,100.00,15,2244.40,12/2/2004 0:00,Shipped,4,12,2004,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Small
2819,10373,29,100.00,1,3978.51,1/31/2005 0:00,Shipped,1,1,2005,...,Torikatu 38,NaN,Oulu,NaN,90110,Finland,EMEA,Koskitalo,Pirkko,Medium
2820,10386,43,100.00,4,5417.57,3/1/2005 0:00,Resolved,1,3,2005,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Medium
2821,10397,34,62.24,1,2116.16,3/28/2005 0:00,Shipped,1,3,2005,...,1 rue Alsace-Lorraine,NaN,Toulouse,NaN,31000,France,EMEA,Roulet,Annette,Small
2822,10414,47,65.52,9,3079.44,5/6/2005 0:00,On Hold,2,5,2005,...,8616 Spinnaker Dr.,NaN,Boston,MA,51003,USA,NaN,Yoshido,Juri,Medium

In [18]:
df_csv = pd.read_csv('sales_data_sample.csv',encoding="latin1")

df_csv.head().info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 25 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ORDERNUMBER       5 non-null      int64
 1   QUANTITYORDERED   5 non-null      int64
 2   PRICEEACH         5 non-null      float64
 3   ORDERLINENUMBER   5 non-null      int64
 4   SALES             5 non-null      float64
 5   ORDERDATE         5 non-null      object
 6   STATUS            5 non-null      object
 7   QTR_ID            5 non-null      int64
 8   MONTH_ID          5 non-null      int64
 9   YEAR_ID           5 non-null      int64
 10  PRODUCTLINE       5 non-null      object
 11  MSRP              5 non-null      int64
 12  PRODUCTCODE       5 non-null      object
 13  CUSTOMERNAME      5 non-null      object
 14  PHONE             5 non-null      object
 15  ADDRESSLINE1      5 non-null      object
 16  ADDRESSLINE2      0 non-null      object
 17  CITY              5 non-null      object
 18  STATE             3 non-null      object
 19  POSTALCODE        4 non-null      object
 20  COUNTRY           5 non-null      object
 21  TERRITORY         2 non-null      object
 22  CONTACTLASTNAME   5 non-null      object
 23  CONTACTFIRSTNAME  5 non-null      object
 24  DEALSIZE          5 non-null      object
dtypes: float64(2), int64(7), object(16)
memory usage: 1.1+ KB

In [19]:
data = {
    "Name":["Rajendra Chimala","Binod Bohara","Khum Chy","Reshma Bohara","Hari Chy","Sumit Parki"],
    "Age":[10,20,30,20,25,21],
    "Salary":[30000,40000,35000,45000,55000,64000],
    "PS":[87,34,50,90,85,99],
    "City":["Doti","Achham","Kailali","Doti","Kailali","Kailali"]
}


df= pd.DataFrame(data)

df.describe()

            Age        Salary         PS
count   6.00000      6.000000   6.000000
mean   21.00000  44833.333333  74.166667
std     6.63325  12734.467663  25.872121
min    10.00000  30000.000000  34.000000
25%    20.00000  36250.000000  58.750000
50%    20.50000  42500.000000  86.000000
75%    24.00000  52500.000000  89.250000
max    30.00000  64000.000000  99.000000

In [23]:
df_csv = pd.read_csv('sales_data_sample.csv',encoding="latin1")

shape = df_csv.shape
column = df_csv.columns


print(f"Shape of Dataset : {shape}")

print(f"Columns in Dataset : {column}")

Shape of Dataset : (2823, 25)
Columns in Dataset : Index(['ORDERNUMBER', 'QUANTITYORDERED', 'PRICEEACH', 'ORDERLINENUMBER',
       'SALES', 'ORDERDATE', 'STATUS', 'QTR_ID', 'MONTH_ID', 'YEAR_ID',
       'PRODUCTLINE', 'MSRP', 'PRODUCTCODE', 'CUSTOMERNAME', 'PHONE',
       'ADDRESSLINE1', 'ADDRESSLINE2', 'CITY', 'STATE', 'POSTALCODE',
       'COUNTRY', 'TERRITORY', 'CONTACTLASTNAME', 'CONTACTFIRSTNAME',
       'DEALSIZE'],
      dtype='object')

# Selecting Specific Column

In [28]:
data = {
    "Name":["Rajendra Chimala","Binod Bohara","Khum Chy","Reshma Bohara","Hari Chy","Sumit Parki"],
    "Age":[10,20,30,20,25,21],
    "Salary":[30000,40000,35000,45000,55000,64000],
    "PS":[87,34,50,90,85,99],
    "City":["Doti","Achham","Kailali","Doti","Kailali","Kailali"]
}

df = pd.DataFrame(data)


# Accessing the Single Column
Name = df['Name']
Name

# Accessing the multiple column


NAA = df[['Name','Age']]
NAA

               Name  Age
0  Rajendra Chimala   10
1      Binod Bohara   20
2          Khum Chy   30
3     Reshma Bohara   20
4          Hari Chy   25
5       Sumit Parki   21

# Filtring Column Datas

In [35]:
data = {
    "Name":["Rajendra Chimala","Binod Bohara","Khum Chy","Reshma Bohara","Hari Chy","Sumit Parki"],
    "Age":[10,20,30,20,25,21],
    "Salary":[30000,40000,35000,45000,55000,64000],
    "PS":[87,34,50,90,85,99],
    "City":["Doti","Achham","Kailali","Doti","Kailali","Kailali"]
}

df = pd.DataFrame(data)

# Single Condition
high_salary = df[df['Salary']>40000]
high_salary



# Multiple Condition 

high_salary_under_22 = df[(df['Salary']>40000) & (df['City']=="Doti")]
high_salary_under_22


# Get Employee from Doti

doti = df[df['City']=='Doti']
doti



# Using Or operation

x = df[(df['Salary']>40000) | (df['City']=="Doti")]
x

               Name  Age  Salary  PS     City
0  Rajendra Chimala   10   30000  87     Doti
3     Reshma Bohara   20   45000  90     Doti
4          Hari Chy   25   55000  85  Kailali
5       Sumit Parki   21   64000  99  Kailali